[
  {
    "id": "1768603758991",
    "title": "Test battle",
    "category": "history",
    "summary": "Test text",
    "content": "Test text",
    "createdAt": "2026-01-16T22:49:18.991Z",
    "period": "Early Bronze Age"
  },
  {
    "id": "1768606553956",
    "title": "TEst middle",
    "category": "history",
    "period": "Middle Bronze Age",
    "summary": "asdfsdfasdfasdf",
    "content": "asfasfsadfasfasdfs",
    "createdAt": "2026-01-16T23:35:53.956Z"
  },
  {
    "id": "1768606569180",
    "title": "TEst latet",
    "category": "history",
    "period": "Late Bronze Age",
    "summary": "afasdfas",
    "content": "asffsdf",
    "createdAt": "2026-01-16T23:36:09.180Z"
  },
  {
    "id": "1768617574204",
    "title": "Sumer",
    "category": "history",
    "period": "Early Bronze Age",
    "summary": "Ancient Sumer represents the earliest known complex civilization in human history, flourishing in southern Mesopotamia between approximately 3300 BCE and 2100 BCE. During this period, Sumerians developed foundational elements of civilization, including urbanization, writing (cuneiform), codified law, monumental architecture, organized religion, and state-level governance.\r\n\r\nSumer was not a unified empire but a network of independent city-states such as Uruk, Ur, Lagash, and Kish, which competed, traded, and occasionally dominated one another. Political power shifted frequently, culminating in foreign conquest—first by Akkadian rulers and later by the Neo-Sumerian revival—before Sumerian independence finally ended around 2100 BCE.\r\n\r\nDespite its political disappearance, Sumer’s cultural, religious, and technological innovations shaped all later Mesopotamian civilizations and, by extension, much of the ancient world.",
    "content": "Geographical and Environmental Context\r\n\r\nSumer was located in the southern portion of Mesopotamia, between the Tigris River and Euphrates River. This region lacked stone, timber, and metal resources but benefited from fertile alluvial soil. Seasonal flooding required irrigation systems, which in turn demanded organized labor and administration—key factors in the emergence of complex society.\r\n\r\nThe necessity of water management encouraged cooperation, hierarchy, and eventually centralized authority, laying the groundwork for city-state governance.\r\n\r\nUrbanization and the Rise of City-States (c. 3300–2900 BCE)\r\n\r\nThe Uruk Period marks the first true urban revolution. Cities expanded rapidly, some reaching populations of tens of thousands. Uruk, in particular, became a cultural and economic hub featuring monumental temple complexes such as the Anu Ziggurat and the Eanna precinct, dedicated to the goddess Inanna.\r\n\r\nEach city-state functioned as a political, religious, and economic unit, ruled by a lugal (king) or ensi (governor), often believed to rule with divine approval. City rivalry was common, leading to frequent warfare and shifting dominance.\r\n\r\nWriting, Administration, and Economy\r\n\r\nAround 3300 BCE, the Sumerians developed cuneiform writing, initially for economic accounting. Over time, it evolved into a system capable of recording laws, hymns, myths, scientific observations, and royal inscriptions.\r\n\r\nThe economy was based on agriculture, temple redistribution, and long-distance trade, extending to regions such as Anatolia, the Indus Valley, and the Persian Gulf. Goods traded included grain, wool, dates, copper, lapis lazuli, and manufactured textiles.\r\n\r\nAdministrative tablets reveal a highly organized society with standardized weights, measures, and labor quotas.\r\n\r\nReligion and Worldview\r\n\r\nReligion permeated all aspects of Sumerian life. The gods were viewed as powerful, anthropomorphic beings who controlled natural forces and human fate. Each city was under the patronage of a primary deity, such as Enlil of Nippur or Nanna of Ur.\r\n\r\nZiggurats served as ritual centers, believed to connect heaven and earth. Humans were created, in Sumerian belief, to serve the gods, and religious observance was essential to maintaining cosmic order.\r\n\r\nPolitical Conflict and the Early Dynastic Period (c. 2900–2350 BCE)\r\n\r\nThe Early Dynastic Period saw intense rivalry among city-states. Kings commemorated victories through inscriptions and stelae, emphasizing divine favor and military prowess.\r\n\r\nNotable rulers such as Eannatum expanded their cities’ influence. The Stele of the Vultures illustrates organized warfare and early concepts of territorial sovereignty.\r\n\r\nDespite conflict, this period also produced advances in law, literature, and art, including early versions of myths that later formed the Epic of Gilgamesh tradition.\r\n\r\nAkkadian Conquest and Cultural Continuity (c. 2350–2150 BCE)\r\n\r\nAround 2350 BCE, Sargon of Akkad unified much of Mesopotamia, creating the first known territorial empire. While Sumerian political autonomy ended, Sumerian culture persisted.\r\n\r\nThe Akkadian Empire adopted Sumerian religious practices, writing systems, and administrative models. Bilingualism became common, with Sumerian remaining a sacred and scholarly language.\r\n\r\nNeo-Sumerian Revival and Final Decline (c. 2100 BCE)\r\n\r\nFollowing the collapse of Akkadian rule, the Third Dynasty of Ur (Ur III) briefly restored Sumerian governance. This period featured legal reforms, massive building projects, and centralized bureaucracy.\r\n\r\nHowever, environmental stress, internal strain, and invasions by groups such as the Elam and Amorites led to collapse around 2100 BCE. After this point, Sumerian survived only as a liturgical and scholarly language.\r\n\r\nLegacy\r\n\r\nSumer’s influence is immeasurable. Its innovations shaped later Mesopotamian civilizations—Akkadian, Babylonian, and Assyrian—and introduced foundational concepts such as:\r\n\r\nWritten law and contracts\r\n\r\nFormal education and scribal schools\r\n\r\nUrban planning and monumental architecture\r\n\r\nMythological and religious frameworks reused across cultures\r\n\r\nThough Sumer vanished as a political entity, it endures as the first chapter of recorded human civilization.",
    "createdAt": "2026-01-17T02:39:34.204Z"
  },
  {
    "id": "1768618108347",
    "title": "Egypt - Early Dynastic Period",
    "category": "history",
    "period": "Early Bronze Age",
    "summary": "Ancient Egypt emerged as one of the world’s earliest and most enduring civilizations, developing along the fertile banks of the Nile River between approximately 3300 BCE and 2100 BCE. During this formative era, Egypt transitioned from regional chiefdoms into a centralized state ruled by divine kings, established a stable religious worldview, perfected monumental stone architecture, and developed a highly structured administrative system.\r\n\r\nThis period encompasses Predynastic Egypt, the Early Dynastic Period, and the Old Kingdom, often referred to as the “Age of the Pyramids.” Unlike the fragmented city-states of Mesopotamia, Egypt achieved early political unification and remarkable continuity, creating a civilization defined by stability, tradition, and a profound concern with order, death, and the afterlife.",
    "content": "Geographical and Environmental Context\r\n\r\nEgypt’s civilization was shaped almost entirely by the Nile. Annual inundations deposited nutrient-rich silt, enabling reliable agriculture in an otherwise arid landscape. The predictable flooding cycle fostered a worldview centered on cosmic order (ma’at)—balance, stability, and continuity.\r\n\r\nNatural barriers such as deserts, seas, and cataracts provided security from invasion, allowing Egypt to develop with relatively limited external disruption compared to Mesopotamia.\r\n\r\nPredynastic Foundations (c. 3300–3100 BCE)\r\n\r\nDuring the Predynastic Period, Egypt consisted of numerous regional cultures, notably in Upper Egypt and Lower Egypt. Increasing social stratification, long-distance trade, and ritual complexity are evident in burial practices and artistic motifs.\r\n\r\nPower gradually consolidated around southern centers such as Nekhen (Hierakonpolis), where early rulers developed symbols of kingship later adopted by unified Egypt.\r\n\r\nUnification and the Early Dynastic Period (c. 3100–2686 BCE)\r\n\r\nAround 3100 BCE, Egypt was unified under a single ruler traditionally identified as Narmer (often equated with Menes). This unification merged Upper and Lower Egypt into a single kingdom ruled from the early capital of Memphis.\r\n\r\nKey developments of this period include:\r\n\r\nThe formalization of divine kingship\r\n\r\nThe development of hieroglyphic writing\r\n\r\nThe creation of centralized taxation, storage, and labor systems\r\n\r\nKings were viewed as living gods, intermediaries between humanity and the divine, responsible for maintaining ma’at throughout the land.\r\n\r\nReligion, Kingship, and the Afterlife\r\n\r\nEgyptian religion emphasized continuity after death and the eternal nature of the soul. Concepts such as the ka, ba, and akh shaped funerary practices and royal ideology.\r\n\r\nMajor deities during this era included Horus, associated with kingship, and Osiris, ruler of the afterlife. The pharaoh was identified with Horus in life and Osiris in death, reinforcing the divine legitimacy of kingship.\r\n\r\nThe Old Kingdom: Centralization and Monumental Power (c. 2686–2181 BCE)\r\n\r\nThe Old Kingdom represents the height of early Egyptian state power. Strong centralized authority enabled massive construction projects, bureaucratic expansion, and artistic standardization.\r\n\r\nOne of the most significant innovations of this era was monumental stone architecture. Under Djoser, architect Imhotep designed the Step Pyramid at Saqqara, the first large-scale stone building in history.\r\n\r\nLater Fourth Dynasty pharaohs oversaw the construction of the great pyramids at Giza, symbolizing royal power, divine order, and eternal kingship.\r\n\r\nAdministration, Economy, and Society\r\n\r\nEgypt’s economy rested on agricultural surplus managed by the state. Grain functioned as currency, tax, and ration. A vast bureaucracy of scribes, overseers, and officials coordinated labor, resource distribution, and religious institutions.\r\n\r\nSociety was hierarchical yet stable:\r\n\r\nPharaoh at the apex\r\n\r\nNobles and priests\r\n\r\nScribes and craftsmen\r\n\r\nFarmers and laborers\r\n\r\nWhile rigid in theory, social mobility was possible through service to the state.\r\n\r\nCrisis and the End of the Old Kingdom (c. 2200–2100 BCE)\r\n\r\nToward the end of this period, centralized authority weakened. Contributing factors likely included:\r\n\r\nClimatic instability and reduced Nile floods\r\n\r\nEconomic strain from monumental building programs\r\n\r\nGrowing power of regional governors (nomarchs)\r\n\r\nBy around 2100 BCE, Egypt entered the First Intermediate Period, marked by political fragmentation and competing regional rulers. Despite this instability, Egyptian culture, religion, and administrative traditions endured.\r\n\r\nLegacy\r\n\r\nBetween 3300 BCE and 2100 BCE, Egypt established enduring cultural patterns that would define it for millennia:\r\n\r\nDivine kingship and centralized rule\r\n\r\nMonumental stone architecture\r\n\r\nA complex religious system focused on order and the afterlife\r\n\r\nArtistic and textual conventions that remained remarkably stable\r\n\r\nUnlike many early civilizations, Egypt’s identity persisted through cycles of collapse and renewal, making this early era not just a beginning, but the foundation of one of history’s longest-lasting civilizations.",
    "createdAt": "2026-01-17T02:48:28.347Z"
  }
]