[
  {
    "id": "1768603758991",
    "title": "Test battle",
    "category": "history",
    "summary": "Test text",
    "content": "Test text",
    "createdAt": "2026-01-16T22:49:18.991Z",
    "period": "Early Bronze Age"
  },
  {
    "id": "1768606553956",
    "title": "TEst middle",
    "category": "history",
    "period": "Middle Bronze Age",
    "summary": "asdfsdfasdfasdf",
    "content": "asfasfsadfasfasdfs",
    "createdAt": "2026-01-16T23:35:53.956Z"
  },
  {
    "id": "1768606569180",
    "title": "TEst latet",
    "category": "history",
    "period": "Late Bronze Age",
    "summary": "afasdfas",
    "content": "asffsdf",
    "createdAt": "2026-01-16T23:36:09.180Z"
  },
  {
    "id": "1768617574204",
    "title": "Sumer",
    "category": "history",
    "period": "Early Bronze Age",
    "summary": "Ancient Sumer represents the earliest known complex civilization in human history, flourishing in southern Mesopotamia between approximately 3300 BCE and 2100 BCE. During this period, Sumerians developed foundational elements of civilization, including urbanization, writing (cuneiform), codified law, monumental architecture, organized religion, and state-level governance.\r\n\r\nSumer was not a unified empire but a network of independent city-states such as Uruk, Ur, Lagash, and Kish, which competed, traded, and occasionally dominated one another. Political power shifted frequently, culminating in foreign conquest—first by Akkadian rulers and later by the Neo-Sumerian revival—before Sumerian independence finally ended around 2100 BCE.\r\n\r\nDespite its political disappearance, Sumer’s cultural, religious, and technological innovations shaped all later Mesopotamian civilizations and, by extension, much of the ancient world.",
    "content": "Geographical and Environmental Context\r\n\r\nSumer was located in the southern portion of Mesopotamia, between the Tigris River and Euphrates River. This region lacked stone, timber, and metal resources but benefited from fertile alluvial soil. Seasonal flooding required irrigation systems, which in turn demanded organized labor and administration—key factors in the emergence of complex society.\r\n\r\nThe necessity of water management encouraged cooperation, hierarchy, and eventually centralized authority, laying the groundwork for city-state governance.\r\n\r\nUrbanization and the Rise of City-States (c. 3300–2900 BCE)\r\n\r\nThe Uruk Period marks the first true urban revolution. Cities expanded rapidly, some reaching populations of tens of thousands. Uruk, in particular, became a cultural and economic hub featuring monumental temple complexes such as the Anu Ziggurat and the Eanna precinct, dedicated to the goddess Inanna.\r\n\r\nEach city-state functioned as a political, religious, and economic unit, ruled by a lugal (king) or ensi (governor), often believed to rule with divine approval. City rivalry was common, leading to frequent warfare and shifting dominance.\r\n\r\nWriting, Administration, and Economy\r\n\r\nAround 3300 BCE, the Sumerians developed cuneiform writing, initially for economic accounting. Over time, it evolved into a system capable of recording laws, hymns, myths, scientific observations, and royal inscriptions.\r\n\r\nThe economy was based on agriculture, temple redistribution, and long-distance trade, extending to regions such as Anatolia, the Indus Valley, and the Persian Gulf. Goods traded included grain, wool, dates, copper, lapis lazuli, and manufactured textiles.\r\n\r\nAdministrative tablets reveal a highly organized society with standardized weights, measures, and labor quotas.\r\n\r\nReligion and Worldview\r\n\r\nReligion permeated all aspects of Sumerian life. The gods were viewed as powerful, anthropomorphic beings who controlled natural forces and human fate. Each city was under the patronage of a primary deity, such as Enlil of Nippur or Nanna of Ur.\r\n\r\nZiggurats served as ritual centers, believed to connect heaven and earth. Humans were created, in Sumerian belief, to serve the gods, and religious observance was essential to maintaining cosmic order.\r\n\r\nPolitical Conflict and the Early Dynastic Period (c. 2900–2350 BCE)\r\n\r\nThe Early Dynastic Period saw intense rivalry among city-states. Kings commemorated victories through inscriptions and stelae, emphasizing divine favor and military prowess.\r\n\r\nNotable rulers such as Eannatum expanded their cities’ influence. The Stele of the Vultures illustrates organized warfare and early concepts of territorial sovereignty.\r\n\r\nDespite conflict, this period also produced advances in law, literature, and art, including early versions of myths that later formed the Epic of Gilgamesh tradition.\r\n\r\nAkkadian Conquest and Cultural Continuity (c. 2350–2150 BCE)\r\n\r\nAround 2350 BCE, Sargon of Akkad unified much of Mesopotamia, creating the first known territorial empire. While Sumerian political autonomy ended, Sumerian culture persisted.\r\n\r\nThe Akkadian Empire adopted Sumerian religious practices, writing systems, and administrative models. Bilingualism became common, with Sumerian remaining a sacred and scholarly language.\r\n\r\nNeo-Sumerian Revival and Final Decline (c. 2100 BCE)\r\n\r\nFollowing the collapse of Akkadian rule, the Third Dynasty of Ur (Ur III) briefly restored Sumerian governance. This period featured legal reforms, massive building projects, and centralized bureaucracy.\r\n\r\nHowever, environmental stress, internal strain, and invasions by groups such as the Elam and Amorites led to collapse around 2100 BCE. After this point, Sumerian survived only as a liturgical and scholarly language.\r\n\r\nLegacy\r\n\r\nSumer’s influence is immeasurable. Its innovations shaped later Mesopotamian civilizations—Akkadian, Babylonian, and Assyrian—and introduced foundational concepts such as:\r\n\r\nWritten law and contracts\r\n\r\nFormal education and scribal schools\r\n\r\nUrban planning and monumental architecture\r\n\r\nMythological and religious frameworks reused across cultures\r\n\r\nThough Sumer vanished as a political entity, it endures as the first chapter of recorded human civilization.",
    "createdAt": "2026-01-17T02:39:34.204Z"
  }
]